app/controllers/houses_controller.rb

  def create
    @house = House.new(house_params)

    if @house.save
---
INSERT INTO "houses" ("name", "author", "source", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Raven Claw"], ["author", "JK Bowlings"], ["source", "Wizard World"], ["created_at", "2018-10-11 19:25:17.329076"], ["updated_at", "2018-10-11 19:25:17.329076"]]