app/controllers/members_controller.rb

  def create
    @house = House.find(params[:house_id])
    @member = Member.new(member_params)
    @member.house = @house

    if @member.save
      flash[:notice] = "Member added successfully"
      redirect_to "/houses/#{params['house_id']}"
    else
      flash[:notice] = @member.errors.full_messages.join(' | ')
---
INSERT INTO "members" ("first_name", "last_name", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Josh"], ["last_name", "Wyman"], ["house_id", 1], ["created_at", "2018-10-11 22:16:40.469650"], ["updated_at", "2018-10-11 22:16:40.469650"]]
SELECT "members".* FROM "members"